import React from 'react'
import { Modal } from 'react-bootstrap'

const Agreement = ({show,onHide}) => {
    return (
        <Modal
            show={show}
            onHide={onHide}
            centered>
            <div
                style={{padding:'40px'}}
            >
                <h4> Политика Конфиденциальности OptiTreadeHub</h4>

                <p>1. Введение</p>
                <p>
                1.1. OptiTreadeHub ценит и уважает конфиденциальность своих пользователей и стремится обеспечить максимальную защиту и безопасность их персональных данных.
                </p>
                <p>
                1.2. Настоящая Политика Конфиденциальности разработана с учетом требований законодательства Республики Казахстан и регулирует сбор, использование и защиту персональной информации пользователей маркетплейса OptiTreadeHub.
                </p>
                <p>
                2. Сбор и использование информации
                </p>
                <p>
                2.1. Мы собираем различные категории персональной информации о наших пользователях, включая, но не ограничиваясь, имена, адреса электронной почты, номера телефонов, адреса доставки и платежные данные. Данная информация собирается с согласия пользователей и используется для обеспечения предоставления услуг, выполнения заказов, обработки платежей, а также для улучшения работы маркетплейса.
                </p>
                <p>
                2.2. Мы также собираем информацию о действиях пользователей на нашем сайте, таких как просмотр страниц, добавление товаров в корзину, совершение покупок и т.д., с целью анализа поведения пользователей и улучшения пользовательского опыта.
                </p>
                <p>
                2.3. Персональная информация пользователей собирается и используется с согласия субъекта персональных данных в соответствии с Законом Республики Казахстан "О персональных данных".
                </p>
                <p>
                3. Хранение и защита данных
                </p>
                <p>
                3.1. Мы придерживаемся высоких стандартов безопасности и применяем соответствующие технические и организационные меры для защиты персональной информации от несанкционированного доступа, изменения, раскрытия или уничтожения.
                </p>
                <p>
                3.2. Персональные данные пользователей хранятся на безопасных серверах и защищены с использованием шифрования данных, а также других методов защиты информации.
                </p>
                <p>
                4. Раскрытие информации третьим лицам
                </p>
                <p>
                4.1. Мы не раскрываем персональную информацию пользователей третьим лицам без их согласия, за исключением случаев, предусмотренных законодательством или в случае необходимости обеспечения выполнения заказов, доставки товаров и т.д.
                </p>
                <p>
                4.2. Партнеры и поставщики услуг имеют доступ к персональной информации пользователей только в объеме, необходимом для выполнения своих обязательств перед OptiTreadeHub и с соблюдением принятых нами мер безопасности.
                </p>
                <p>
                5. Права пользователей
                </p>
                <p>
                5.1. Пользователи имеют право на доступ к своей персональной информации и могут запросить ее исправление или удаление в случае обнаружения ошибок или неполных данных.
                </p>
                <p>
                5.2. Пользователи также имеют право на ограничение обработки своих персональных данных и на передачу своих данных в другую организацию по запросу.
                </p>
                <p>
                6. Информация о товарах и услугах
                </p>
                <p>
                6.1. Мы храним и обрабатываем информацию о товарах и услугах, предоставленных на нашем маркетплейсе, с целью предоставления информации пользователям, выполнения заказов и улучшения качества предоставляемых услуг.
                </p>
                <p>
                6.2. Описание и характеристики товаров и услуг полностью задаются поставщиками, и мы не несем ответственности за точность и достоверность этой информации.
                </p>
                <p>
                7. Передача данных за пределы Республики Казахстан
                </p>
                <p>
                7.1. Персональные данные пользователей могут передаваться за пределы Республики Казахстан только при соблюдении требований законодательства и с учетом международных соглашений о защите данных.
                </p>
                <p>
                8. Управление настройками конфиденциальности
                </p>
                <p>
                8.1. Мы предоставляем пользователям возможность управления своими настройками конфиденциальности, в том числе отказаться от рассылки рекламных сообщений или управлять доступом к их персональным данным.
                </p>
                <p>
                9. Передача данных за пределы Республики Казахстан
                </p>
                <p>
                9.1. Маркетплейс может передавать персональные данные пользователей за пределы Республики Казахстан только с их согласия и в соответствии с требованиями законодательства о защите данных.
                </p>
                <p>
                9.2. При передаче данных за границу Маркетплейс обеспечивает соблюдение необходимых мер безопасности и подписывает соответствующие договоры о защите данных с получателями информации.
                </p>
                <p>
                10. Сроки хранения данных
                </p>
                <p>
                10.1. Маркетплейс хранит персональные данные пользователей только в течение периода, необходимого для достижения целей, для которых эти данные были собраны, если иное не предусмотрено законодательством.
                </p>
                <p>
                10.2. После истечения срока хранения или по требованию пользователя персональные данные уничтожаются или делаются анонимными таким образом, чтобы они больше не могли быть идентифицированы.
                </p>
                <p>
                11. Принятие Политики Конфиденциальности
                </p>
                <p>
                11.1. Использование услуг Маркетплейса подразумевает согласие пользователя с условиями настоящей Политики Конфиденциальности.
                </p>
                <p>
                11.2. Пользователи обязаны ознакомиться с Политикой Конфиденциальности перед использованием Маркетплейса и в случае несогласия с ней воздержаться от использования услуг.
                </p>
                <p>
                12. Изменения в политике конфиденциальности
                </p>
                <p>
                12.1. Маркетплейс оставляет за собой право вносить изменения в настоящую Политику Конфиденциальности в любое время.
                </p>
                <p>
                12.2. Изменения вступают в силу с момента их публикации на сайте Маркетплейса. Пользователи обязаны периодически проверять Политику Конфиденциальности на предмет изменений.
                </p>
                <p>
                13. Заключительные положения
                </p>
                <p>
                13.1. Настоящая Политика Конфиденциальности является неотъемлемой частью пользовательского соглашения и действует вместе с другими правилами и положениями Маркетплейса.
                </p>
                <p>
                13.2. В случае противоречия между условиями настоящей Политики Конфиденциальности и другими документами Маркетплейса, предпочтение отдается условиям настоящей Политики Конфиденциальности.
                </p>
                <p>
                14. Контакты
                </p>
                <p>
                14.1. Для любых вопросов, связанных с обработкой и защитой персональных данных, пользователи могут обращаться к Маркетплейсу по адресу электронной почты  enactusKVPTK@gmail.com или по телефону +7 (747) 309 1472.
                </p>
                <p>
                15. Положения об использовании файлов cookie
                </p>
                <p>
                15.1. Маркетплейс использует файлы cookie для улучшения работы сайта, персонализации контента и рекламы, а также для анализа трафика.
                </p>
                <p>
                15.2. Пользователи имеют возможность управлять настройками cookie через свой браузер и выбирать, принимать или отклонять их использование в соответствии с их предпочтениями.
                </p>
                <p>
                16. Принятие Политики в части файлов cookie
                </p>
                <p>
                16.1. Использование сайта Маркетплейса подразумевает согласие пользователя с использованием файлов cookie в соответствии с настоящей Политикой Конфиденциальности.
                </p>
                <p>
                16.2. Пользователи могут в любое время изменить свои настройки относительно использования файлов cookie или отказаться от их использования путем соответствующей настройки своего браузера.
                </p>
                <p>
                Дата вступления в силу: [Дата вступления в силу Политики Конфиденциальности]
                </p>
                <p>
                Конец Политики Конфиденциальности
                </p>
                <p>
                Мы ценим ваше доверие и обязуемся обеспечить защиту и конфиденциальность ваших данных на OptiTradeHub.
                </p>
            </div>
        </Modal>
    )
}

export default Agreement